ubopod/ubo_app/ubo_lvgl/esp32/sdkconfig.defaults
# Defaults for the ESP32-C6-Touch-AMOLED-1.8.
# NOTE: the ESP32-C6 has 512KB SRAM and NO PSRAM — do not enable CONFIG_SPIRAM.
CONFIG_IDF_TARGET="esp32c6"

# 16MB flash, QIO.
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# 160MHz, perf optimization.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# 1kHz tick gives LVGL smooth ~ms timing.
CONFIG_FREERTOS_HZ=1000

# app_main runs board + renderer init; give it headroom.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
